In [2]:
import pandas as pd
import numpy as np

In [5]:
dict1={'name':['priti','samar',np.nan,'siri','snehal','shubham'],
      'age':[np.nan,21,31,41,33,44],
      'city':['hyd','nashik','mumbai','pune','dhule',np.nan]}

In [10]:
d1=pd.DataFrame(dict1)
d1

      name   age    city
0    priti   NaN     hyd
1    samar  21.0  nashik
2      NaN  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0     NaN

In [7]:
dict2={'name':['priti','samar',None,'siri','snehal','shubham'],
      'age':[np.nan,21,31,41,33,44],
      'city':['hyd','nashik','mumbai','pune','dhule',None]}

In [11]:
d2=pd.DataFrame(dict2)

In [12]:
d2

      name   age    city
0    priti   NaN     hyd
1    samar  21.0  nashik
2     None  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0    None

In [14]:
d1.isna().sum()

3

In [17]:
d2.isna().sum()

name    1
age     1
city    1
dtype: int64

In [24]:
(d1['name'].isna().sum()/d1['name'].count())*100

20.0

In [25]:
d1.value_counts()

name    age   city
samar   21.0  nashik    1
siri    41.0  pune      1
snehal  33.0  dhule     1
dtype: int64

In [27]:
d1.fillna(40)

      name   age    city
0    priti  40.0     hyd
1    samar  21.0  nashik
2       40  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0      40

In [30]:
d1['age'].fillna(40,inplace=True)

In [31]:
d1

      name   age    city
0    priti  40.0     hyd
1    samar  21.0  nashik
2      NaN  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0     NaN

In [33]:
d1['name'].fillna('priti',inplace=True)

In [34]:
d1

      name   age    city
0    priti  40.0     hyd
1    samar  21.0  nashik
2    priti  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0     NaN

In [35]:
d1=pd.DataFrame(dict1)
d1

      name   age    city
0    priti   NaN     hyd
1    samar  21.0  nashik
2      NaN  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0     NaN

In [36]:
d1.fillna(method='bfill')

      name   age    city
0    priti  21.0     hyd
1    samar  21.0  nashik
2     siri  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0     NaN

In [37]:
d1.fillna(method='ffill')

      name   age    city
0    priti   NaN     hyd
1    samar  21.0  nashik
2    samar  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0   dhule

In [40]:
d1.fillna(method='pad',axis=1)

      name    age    city
0    priti  priti     hyd
1    samar   21.0  nashik
2      NaN   31.0  mumbai
3     siri   41.0    pune
4   snehal   33.0   dhule
5  shubham   44.0    44.0

In [39]:
d1.fillna(method='backfill')

      name   age    city
0    priti  21.0     hyd
1    samar  21.0  nashik
2     siri  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0     NaN

### Mean,median,mode

In [41]:
d1=pd.DataFrame(dict1)
d1

      name   age    city
0    priti   NaN     hyd
1    samar  21.0  nashik
2      NaN  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0     NaN

In [42]:
d1['name'].fillna(d1['name'].mode())

0      priti
1      samar
2    shubham
3       siri
4     snehal
5    shubham
Name: name, dtype: object

In [43]:
d1['age'].fillna(d1['age'].mean())

0    34.0
1    21.0
2    31.0
3    41.0
4    33.0
5    44.0
Name: age, dtype: float64

In [44]:
d1['age'].fillna(d1['age'].median())

0    33.0
1    21.0
2    31.0
3    41.0
4    33.0
5    44.0
Name: age, dtype: float64

### KNN

In [45]:
d1=pd.DataFrame(dict1)
d1

      name   age    city
0    priti   NaN     hyd
1    samar  21.0  nashik
2      NaN  31.0  mumbai
3     siri  41.0    pune
4   snehal  33.0   dhule
5  shubham  44.0     NaN

In [49]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['age']])

array([[34.],
       [21.],
       [31.],
       [41.],
       [33.],
       [44.]])